In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

# Series

In [2]:
series=Series([2,3,4,5,6,9,14.5,6.7])
series

0     2.0
1     3.0
2     4.0
3     5.0
4     6.0
5     9.0
6    14.5
7     6.7
dtype: float64

In [3]:
series=Series([2,3,4,5], index=['row 1','row 2','row 3','row 4'])
series

row 1    2
row 2    3
row 3    4
row 4    5
dtype: int64

# selecting and retrieving dara from series

In [4]:
#indexing 
print(series['row 4'])
series[2]

5

4

In [5]:
series=Series([2,3,4,5,6,9])

In [6]:
#slicing 
series[2:5]

2    4
3    5
4    6
dtype: int64

In [7]:
series[[1,3,5]]

1    3
3    5
5    9
dtype: int64

# DataFrame

In [8]:
datalist=np.floor(np.random.random(36).reshape(6,6)*100)
datalist

array([[31.,  5., 39., 74., 24.,  6.],
       [30.,  8.,  7., 19., 89., 49.],
       [19., 95., 17.,  9., 93., 96.],
       [21., 13., 74., 77., 71., 15.],
       [90., 89., 18., 56., 67., 98.],
       [ 6., 81.,  5., 21., 93., 76.]])

In [9]:
# creating dataframe object
df=DataFrame(datalist)
df

      0     1     2     3     4     5
0  31.0   5.0  39.0  74.0  24.0   6.0
1  30.0   8.0   7.0  19.0  89.0  49.0
2  19.0  95.0  17.0   9.0  93.0  96.0
3  21.0  13.0  74.0  77.0  71.0  15.0
4  90.0  89.0  18.0  56.0  67.0  98.0
5   6.0  81.0   5.0  21.0  93.0  76.0

In [10]:
col=['r1','r2','r3','r4','r5','r6']
index=['i1','i2','i3','i4','i5','i6']

In [11]:
#creating a dataframe object with index and column name specific
df=DataFrame(datalist,index=index,columns=col)
df

      r1    r2    r3    r4    r5    r6
i1  31.0   5.0  39.0  74.0  24.0   6.0
i2  30.0   8.0   7.0  19.0  89.0  49.0
i3  19.0  95.0  17.0   9.0  93.0  96.0
i4  21.0  13.0  74.0  77.0  71.0  15.0
i5  90.0  89.0  18.0  56.0  67.0  98.0
i6   6.0  81.0   5.0  21.0  93.0  76.0

In [12]:
df[2:]

      r1    r2    r3    r4    r5    r6
i3  19.0  95.0  17.0   9.0  93.0  96.0
i4  21.0  13.0  74.0  77.0  71.0  15.0
i5  90.0  89.0  18.0  56.0  67.0  98.0
i6   6.0  81.0   5.0  21.0  93.0  76.0

In [13]:
df.loc['i5','r1']

90.0

In [14]:
df.loc[['i5','i6'],['r4','r5']]

      r4    r5
i5  56.0  67.0
i6  21.0  93.0

In [15]:
df.iloc[1,1]

8.0

In [16]:
df.loc[:,'r4':]

      r4    r5    r6
i1  74.0  24.0   6.0
i2  19.0  89.0  49.0
i3   9.0  93.0  96.0
i4  77.0  71.0  15.0
i5  56.0  67.0  98.0
i6  21.0  93.0  76.0